# coding: utf-8

import gensim
from konlpy.tag import Mecab

from gensim import corpora
from pprint import pprint
from mecab import MeCab
from DB_retriever import select_normalized
import pandas as pd
import requests
import json
import urllib
from PIL import Image
from karlo import t2i
from papago import translate_with_papago

# 띄어쓰기 정형화 된 것들 다시 불러와서 데이타프레임으로 저장
rows = select_normalized(['title', 'comments'])
df = pd.DataFrame(rows, columns=['Title', 'Comments'])

# 토큰화
stopwords = ['츠', '진행', '탑', '즈', '나중', '끈', '즈 ', '짐 ', '이야기 ', '츠 ', '당장 ', '슈', '나중 ', '진행 ', '하트 ', '스타일링 ', '일본 ', '지퍼 ', '슈 ', '에스 ', '카드 ', '세인 ', '끌 ', '이야기 ', '에스 ', '끈 ', '메종 ', '길이 ', '참여', '알파카', '제목', '트렌드', '완성', '사이', '포기', '장바구니', '국내', '노력', '감기',
             '예스', '효과', '세탁', '턱', '열', '얄', '일반', '보통', '연출', '블랭크', '주름', '연출', '노드', '유익', '천', '발매', '스탈', '발매', '신상',
             '쇼핑몰', '스트라이프', '수능', '이것', '걸까요', '브이', '입문', '스탠다드', '제니', '종류', '검색', '앱', '르소', '여러분', '내가', '너가', '얼마나', '얼', '폼', '품', '피', '시크', '공홈',
             '공식', '홈피', '홈에', '환불', '교환', '메이드', '콘텐츠', '내년', '카멜', '팝업', '건조',
             '텐데', '꿀', '털', '욥', '방송', '옛날', '자연', '신청', '질', '퀄리티', '팩', '소비',
             '바이', '이프', '임', '신청', '넹', '사이트', '에스', '일본', '우재', '이야기',
             '잇', '식', '보풀', '켓', '밑', '사이드', '엔더슨', '업로드', '뉴욕', '질문', '재고', '제고',
             '요새', '최애', '레시피', '엣날', '요즘', '직원', '내용', '롬', '룸', '아트', '포스', '왼쪽', '오른쪽', '예기 ', '얘기', '프레이', '제작', '정',
             '주우재', '인상', '인생', ' 얘기', '코드', '발마', '시도', '버전', '결혼식', '삼', '박', '서울', '비슬', '누가', '짱구', '샷', '건강', '클릭',
             '애프터', '마무리', '터리', '가지', '다드', '워', '스펙', '라이브', '가용', '가융', '가요', '엘', '미국', '종아리', '완벽',
             '재질', '나라', '여행', '문', '트위드', '사일런스', '파브레', '엘피', '옷장', '엘', '앨',
             '우터', '조심', '문제', '판매', '넌', '인기', '화이팅', '플랙', '판맨', '슬로우', '편집',
             '십', '컨', '추석', '최근', '길이', '필수', 'ㅂ', '세인', '가원', '립', '조아', '품질', '유투', '입장',
             '이거', '폴', '앤', '엔', '협찬', '민정', '혜', '해', '앤', '엔' '얜', '여유', '완료',
             '리스', '커버', '확인', '해외', '로우', '하이', '프로', '글', '비교', '달', '관련', '옆',
             '아래', '위', '옆에', '계절', '이유', '세트', '원단', '칸', '차이', '이드', '저번',
             '쉐', '구경', '블', '팁', '불편', '펜', '소장', '부', '숏', '냄새', '행', '브',
             '구', '걸로', '정상', '합리', '언제', '디자이너', '벨', '가격대', '밖', '스탠딩', '장점', '단점', '드립', '드림', '꿈',
             '한계', '고집', '마음', '감정', '말투',
             '섹', '유용', '해당', '아디', '인트', '기획', '걱정', '런', '목소리', '페이스', '법',
             '기간', '선물', '취', '샵', '노', '공감', '쪽', '저격', '당첨', '성주', '기분', '매장',
             '건데', '막', '저거', '반품', '멀', '기회', '감', '실물', '중간', '대박', '그', '비',
             '플', '하루', '왕', '초반', '팬', '필인', '팩토리', '거기', '만큼', '코', '예정', '머',
             '쇼', '벌', '전체', '분위기', '아웃', '뭔지', '뒤', '경우', '중요', '말씀', '간', '카드', '그라피', '경험', '하프',
             '오랜만', '알리', '안녕', '르', '정가', '모', '날', '투', '흔적', '구대', '얼마', '빵', '뺑', '뻥',
             '소화', '허리', '준비', '바디', '선물 ', '선택', '끌레르', '헤어', '비율', '탠', '텐', '짐', '표현', '주변', '탐',
             '끌', '끝', '꼴', '꿀', '그거', '거기', '고기', '저녁', '점심', '아침', '대형', '하객', '잼', '잼민',
             '어깨', '추가', '급', '픽', '스타', '반', '자기', '엄마', '세상', '선생', '귀', '개꿀', '낭', '히프',
             '회사', '의류', '당장', '뿐', '젯', '뮤', '잿', '답변', '답장', '리플', '댓글', '뎃글', '덧글',
             '물', '몰', '웜', '왐', '웸', '웟', '왓',
             '꺼', '뭘', '바', '둘', '무엇', '피부', '윗배', '초', '날씨', '세상', '적용', '백', '딩', '트리', '속', '빅', '건가',
             '씨', '버', '기준', '북', '복', '몸', '타임', '출근', '배', '이건', '곳', '수선', '본인', '명', '예', '로고', 'ㅅ',
             '썸', '럼', '곳', '패', '영', '김', '컷', '목', '손', '이름', '미', '월', '아카이브', '선', '정리', '차', '포', '줄',
             '인사', '발', '친구', '성비', 'ㄹ', '자신', '테', '시', '참고', '삭', '덕', 'ㄱ', '난', '나이', '처음', '기', '드', '바시',
             '다양', '고급', '다음', '랜드', '템', '때문', '용', '집', '소재', '찰떡', '힘', '리뷰', '맛집', '리뷰', '후기', '마지막', '고민',
             '행복', '광고', '상품', '사용', '운동', '조합', '시간', '링크', '활용', '완전', '부분', '너', '인', '마지막', '시간', '미친', '갓',
             '말', 'ㅈ', '같은', '색상', '업', '오', '중', '앞', '뭔가', '디자인', '가장', '분', '스타일', '깡', '건', '랜듯', '쿠폰', '가능',
             '아이템', '디테일', '템;', '돈', '진심', '정보', '옷', '룩', '브랜드', '하나', '언니', '착용', '콜라보', '이번', '바지', '제품', '가요',
             '제', '코디', '포인트', '일', '할인', '겨울', '여름', '봄', '가을', '포인트', '사람', 'ㄷ', '실장', '생각', '전', '소개', '패션', '때',
             '듯', '저', '어디', '정도', '뉴', '소개', '창고', '세일', '부탁', '원', '껀', '할인', '러브', '사랑', '콜', '나', '먀치', '매치', '슈즈',
             '색', '주문', '기달', '리는', '구입', '핏', '거', '데', '니', '후기', '사용기', 'ㄴ', '체형', '튜버', '굿', '우리', '이게', '되네', '된다',
             '쇼핑', '온라인', '신경', '라인', 'ㅇㅋ', '퀄리티', '이벤트', '관리', '쌤', '마음', '사진', '건지', '가격', '작년', '올해', '매년', '은인', '정말',
             '배송', '평소', '힘', '머리', '점', '관심', '항목', '준수', '모습', '한국', '외국', '기장', '끝', '설명', '방법', '남', '소리', '개', '센스', '빠',
             '조', '자체', '나미', '크림', '여성', '남성', '색감', '롱', '지갑', '상', '기본', '셋', '시작', '부담', '장', '등', '컨텐츠', '매력', '터', '채널',
             '유튜브', '구독', '구독자', '응원', '이상', '도움', '엘더', '신사', '윌', '예전', '디', '랩', '편', '광자', '눈', '맛', '만족', '여기', '덕분', '내',
             '위', '필요', '모자', '상의', '하의', '신발', '장갑', '키', '댓글', '기대', '얼굴', '여', '걸', '모델', '최고', '존', '존나', '건가요', '시즌', '개인',
             '취향', 'ㅋ', '맞', '유행', '이쁘', 'ㅎ ㅎ', '사랑', '못', '최', '애', '짱', '지금', '착장', '다른', '근데', '라고', '년', '울', '닿', '당', '어떻게',
             '품절', '살', '죠', '어울리', '길', '뭐', '트', '진', '유', '두', '특히', '폼', '멋', '다니', '대', '셔서', '랜트', '맘', '의', '은', '들', '는', '과',
             '하다', '하', '을', '고', '좋', '님', '영상', '지', '보', '게', '주', '했', '번', '아', '만', '구매', '한다', '에', '로', '으로', '형', '어요',
             '수', '것', '진짜', '합니다', '을까요', '알', '적', '어', '같', '넘', '더', '추천', '네', '사', '할', '싶', '감사', '오늘', '나요', '어서', '아요', '서',
             '지만', '보이', 'ㅎㅎ', '겠', '면', '습니다', '되', '에서', '라', '도', '았', '해', '다고', '된', '세요', '어떤', '느낌', '인데', '해요', '려고', '후',
             '는데', '요즘', '안', '않', '면서', '주고', '같은', '아서', '다면', '아직', '되어', '다시', '다가', '아는', '네요', '니까', '다는', '입니다', '어도', '다니',
             '던', '세', '된다', '요', '와', '라는', '게', '이', '다', '아야', '이다', '랑', '에서는', '라면', '라도', '이나', '아도', '나서', '되는', '되도록', '아라',
             '든', '이라', '요', '되고', '신', '도록', '어라', '거나', '니', '래', '된', '되어', '서는', '보다', '여', '되면', '게요', '습니다', '라서', '리', '대한', '어야',
             '다고', '에서도', '이라고', '해도', '해서', '죠', '주는', '주신', '든지', '나도', '요', '와도', '보이는', '주시', '도다', '되서', '도의', '이라는', '해서도', '아이',
             '이라면', '되지', '주어', '에서의', '아서도', '라든지', '에서만', '도로', '되도록이면', '이야', '이었다', '보아', '되는데', '되게', '이라도', '라도', '더라도', '이서', '되냐',
             '되지만', '게서', '이라서', '가도', '되어서', '아이고', '에서라도', '되어야', '아래서', '되었다', '서도', '되어도', '리라', '라곤', '에서나', '나아', '서라', '라', '주', '되',
             '니', '이', '입니다', '세요', '네요', '요', 'ㅎ', 'ㅋ', '컬러', '다고', '사이즈', '입', '에서', '다는', '해요',
             '카페', '옷걸이', '홍', '결제', '띠', '요청', '여자', '남자', '유니클로', '토', '노이어', '몸매', '다스', '리셀',
             '동안', '홈페이지', '홈패이지', '학생', '창', '댓', '앤더슨', '히든', '퍼', '칼', '웻', '팔', '당첨자', '독특', '오프닝', '이미지', '축하'
             '지디', '신뢰', '심', '상승', '꽁', '편안', '널', '금전', '웨이', '중반', '운', '망',
             '명향력', '상황', '콜리', '그리', '크리', '근본', '마이크', '공유', '돼지', '하체',
             '상체', '오빠', '언니', '동생', '나', '너', '님', '왜', '크기', '톰', '턱', '틱',
             '택', '안녕', '하세요', '해요', '까요', '극', '어마', '아시아', '동아시아', '서양',
             '동양', '유럽', '극', '분노', '행복', '좋아', '좋지', '않', '해', '허', '만',
             '급식', '공구', '익스프레스', '토니', '중독', '밸런스', '브리', '조크', '실례', '연기', '맞음', '지디', '거짓말',
             '바다', '샤넬', '브렌드', '브랜드', '처리', '의미', '롤', '룰', '그게', '뭐', '뭐임',
             '시청', '별', '축하', '메', '뱃', '도매', '도메', '웨어', '해주', '소화력', '아시', '수정',
             '힙', '향', '혜인', '브렌', '감성', '코어', '쿠어', '사향', '왕발', '다리', '지드래곤', '오디션', '측정기',
             '주세', '공부', '재미', '웩', '이해', '리스트', '세계', '세미', '메종', '사고', '스타일링', '스타일', '사건',
             '주식', '코인', '급증', '너도', '나도', '유행', '인기', '패션', '개', '나', '소', '음', '응', '야', '뭐',
             '이걸', '붕괴', '대대', '색깔', '타협', '프로필', '거인', '에피소드', '논쟁', '우파',
             '전이나', '지금이나', '디자이너들이', '좋아하는', '키는', '변함이', '없네요', '라이브도', '최고였음',
             '이어도', '상하체', '비율이', '문제인', '경우가', '있죠', '그래서', '오빠가', '바로', '이상적인', '키라는',
             '주우재도', '넘어', '보이는데', 'ㅋㅋㅋㅋㅋ', '겁나', '거인이던', 'ㅋㅋㅋㅋ', '큰', '애들끼리의', '궁금했는데', '재미있게', '썰', '풀어서', '웃김',


             ]

# 불용어 뒤에 띄어쓰기 있는것 까지 같이 추가해서 제거
new_stopwords = []
for word in stopwords:
    new_stopwords.append(word + ' ')
    new_stopwords.append(word)
    new_stopwords.append(' ' + word)
    new_stopwords.append(' ' + word + ' ')


# 토큰화 및 불용어 제외
tagger = MeCab()

title_tokened = []
for comments in df['Comments']:
    for comment in comments:
        tokened_words = tagger.nouns(comment)

        print(f'불용어 필터 이후 문장들 지금은 토큰화x (다음 아래 있는 단어들 줄에 패션 아이템 아닌것 삭제)')
        tokend = [word for word in tokened_words if not word in new_stopwords]

        print(tokend)

        print(
            f'불용어에서 있는 단어들:{[word for word in tokend if word in new_stopwords]}')
        title_tokened.append(tokend)


# 단어 사전 생성
dictionary = corpora.Dictionary(title_tokened)

# 문서-단어 매트릭스 생성
corpus = [dictionary.doc2bow(text) for text in title_tokened]

# LDA 모델 학습
num_topics = 10
lda_model = gensim.models.LdaModel(
    corpus, num_topics=num_topics, id2word=dictionary, passes=15)


# 칼로 불용어 설정
negative_prompt = "sleeping cat, dog, ugly face, cropped"

# 학습된 토픽들 출력
topics = lda_model.print_topics(num_words=10)
for topic in topics:
    print(topic)
# for idx, topic in topics:
#     words_kr = [word.split('*')[1].replace('"', '').strip()
#                 for word in topic.split('+')]
#     print(f'토픽 {idx} : {words_kr}')

#     # 번역
#     words_en = translate_with_papago(words_kr)

#     print(words_en)
#     response = t2i(words_en, negative_prompt)
#     result = Image.open(urllib.request.urlopen(
#         response.get("images")[0].get("image")))
#     result.show()


# 새로운 문서에 대한 토픽 분포 예측
# new_doc = "오늘 뭐 입지? 가을인데 코트를 입어야 하나? 코트 추천좀 해줘"
# new_doc_1 = [word for word in tagger.nouns(new_doc) if not word in stopwords]
# new_doc_bow = dictionary.doc2bow(new_doc_1)
# print(lda_model.get_document_topics(new_doc_bow))
