from DB_connector import get_db_connection
from io import StringIO
import psycopg2
from keras.models import load_model
from sklearn.model_selection import train_test_split
from tensorflow.keras.layers import Embedding, Bidirectional, LSTM, Dense
from tensorflow.keras.preprocessing.sequence import pad_sequences
from tensorflow.keras.preprocessing.text import Tokenizer
from tensorflow.keras.models import Sequential
import pandas as pd
import time
from DB_retriever import select_query
import re
import numpy as np
from pykospacing.kospacing import Spacing
from mecab import MeCab
# 토큰화
stopwords = ['츠', '진행', '탑', '즈', '나중', '끈', '즈 ', '짐 ', '이야기 ', '츠 ', '당장 ', '슈', '나중 ', '진행 ', '하트 ', '스타일링 ', '일본 ', '지퍼 ', '슈 ', '에스 ', '카드 ', '세인 ', '끌 ', '이야기 ', '에스 ', '끈 ', '메종 ', '길이 ', '참여', '알파카', '제목', '트렌드', '완성', '사이', '포기', '장바구니', '국내', '노력', '감기',
             '예스', '효과', '세탁', '턱', '열', '얄', '일반', '보통', '연출', '블랭크', '주름', '연출', '노드', '유익', '천', '발매', '스탈', '발매', '신상',
             '쇼핑몰', '스트라이프', '수능', '이것', '걸까요', '브이', '입문', '스탠다드', '제니', '종류', '검색', '앱', '르소', '여러분', '내가', '너가', '얼마나', '얼', '폼', '품', '피', '시크', '공홈',
             '공식', '홈피', '홈에', '환불', '교환', '메이드', '콘텐츠', '내년', '카멜', '팝업', '건조', '대장', '뒷모습', '힐링', '쥐', '고생', '아브', '오니', '우', '린', '음악', '탬', '생일', '에어포스', '쯤', '에너지', '애너지', '보유', '먼지', '집안', '컴퍼니',
             '텐데', '꿀', '털', '욥', '방송', '옛날', '자연', '신청', '질', '퀄리티', '팩', '소비', '여드름', '잡티', '홍조', '흉터', '피부', '흉', '아토피', '질병', '혹', '못생김', '못생', '못', '얼굴', '처', '메스', '코로나', '경상도', '어데',
             '바이', '이프', '임', '신청', '넹', '사이트', '에스', '일본', '우재', '이야기', '케익', '기존', '슬립', '잠', '머리', '돌', '굳', '뾰루지', '프라이데이', '레전드', '식감', '인건비', '머니', '대두', '강', '뮬',
             '잇', '식', '보풀', '켓', '밑', '사이드', '엔더슨', '업로드', '뉴욕', '질문', '재고', '제고',
             '요새', '최애', '레시피', '엣날', '요즘', '직원', '내용', '롬', '룸', '아트', '포스', '왼쪽', '오른쪽', '예기 ', '얘기', '프레이', '제작', '정',
             '주우재', '인상', '인생', ' 얘기', '코드', '발마', '시도', '버전', '결혼식', '삼', '박', '서울', '비슬', '누가', '짱구', '샷', '건강', '클릭',
             '애프터', '마무리', '터리', '가지', '다드', '워', '스펙', '라이브', '가용', '가융', '가요', '엘', '미국', '종아리', '완벽',
             '재질', '나라', '여행', '문', '트위드', '사일런스', '파브레', '엘피', '옷장', '엘', '앨',
             '우터', '조심', '문제', '판매', '넌', '인기', '화이팅', '플랙', '판맨', '슬로우', '편집',
             '십', '컨', '추석', '최근', '길이', '필수', 'ㅂ', '세인', '가원', '립', '조아', '품질', '유투', '입장',
             '이거', '폴', '앤', '엔', '협찬', '민정', '혜', '해', '앤', '엔' '얜', '여유', '완료',
             '리스', '커버', '확인', '해외', '로우', '하이', '프로', '글', '비교', '달', '관련', '옆',
             '아래', '위', '옆에', '계절', '이유', '세트', '원단', '칸', '차이', '이드', '저번',
             '쉐', '구경', '블', '팁', '불편', '펜', '소장', '부', '숏', '냄새', '행', '브',
             '구', '걸로', '정상', '합리', '언제', '디자이너', '벨', '가격대', '밖', '스탠딩', '장점', '단점', '드립', '드림', '꿈',
             '한계', '고집', '마음', '감정', '말투', '자라', '궁합', '히스', '멜', '형태', '언급', '금요일', '목요일', '하비', '대가', '구호', '컨버스', '어리', '어린', '반팔', '샌드', '광주', '에러', '레벨', '달바', '존중', '우재형', '우재', '미스트', '이클립스', '약점', '리얼', '보세', '군대', '타이밍',
             '섹', '유용', '해당', '아디', '인트', '기획', '걱정', '런', '목소리', '페이스', '법',
             '기간', '선물', '취', '샵', '노', '공감', '쪽', '저격', '당첨', '성주', '기분', '매장',
             '건데', '막', '저거', '반품', '멀', '기회', '감', '실물', '중간', '대박', '그', '비',
             '플', '하루', '왕', '초반', '팬', '필인', '팩토리', '거기', '만큼', '코', '예정', '머',
             '쇼', '벌', '전체', '분위기', '아웃', '뭔지', '뒤', '경우', '중요', '말씀', '간', '카드', '그라피', '경험', '하프',
             '오랜만', '알리', '안녕', '르', '정가', '모', '날', '투', '흔적', '구대', '얼마', '빵', '뺑', '뻥',
             '소화', '허리', '준비', '바디', '선물 ', '선택', '끌레르', '헤어', '비율', '탠', '텐', '짐', '표현', '주변', '탐',
             '끌', '끝', '꼴', '꿀', '그거', '거기', '고기', '저녁', '점심', '아침', '대형', '하객', '잼', '잼민',
             '어깨', '추가', '급', '픽', '스타', '반', '자기', '엄마', '세상', '선생', '귀', '개꿀', '낭', '히프',
             '회사', '의류', '당장', '뿐', '젯', '뮤', '잿', '답변', '답장', '리플', '댓글', '뎃글', '덧글',
             '물', '몰', '웜', '왐', '웸', '웟', '왓', '요소', '엉덩이', '신기', '한남동', '동네', '지방', '키드', '디키', '경', '지역', '우리', '수납', '한쪽', '카리나', '윈터', '비이',
             '꺼', '뭘', '바', '둘', '무엇', '피부', '윗배', '초', '날씨', '세상', '적용', '백', '딩', '트리', '속', '빅', '건가',
             '씨', '버', '기준', '북', '복', '몸', '타임', '출근', '배', '이건', '곳', '수선', '본인', '명', '예', '로고', 'ㅅ',
             '썸', '럼', '곳', '패', '영', '김', '컷', '목', '손', '이름', '미', '월', '아카이브', '선', '정리', '차', '포', '줄',
             '인사', '발', '친구', '성비', 'ㄹ', '자신', '테', '시', '참고', '삭', '덕', 'ㄱ', '난', '나이', '처음', '기', '드', '바시',
             '다양', '고급', '다음', '랜드', '템', '때문', '용', '집', '소재', '찰떡', '힘', '리뷰', '맛집', '리뷰', '후기', '마지막', '고민',
             '행복', '광고', '상품', '사용', '운동', '조합', '시간', '링크', '활용', '완전', '부분', '너', '인', '마지막', '시간', '미친', '갓',
             '말', 'ㅈ', '같은', '색상', '업', '오', '중', '앞', '뭔가', '디자인', '가장', '분', '스타일', '깡', '건', '랜듯', '쿠폰', '가능',
             '아이템', '디테일', '템;', '돈', '진심', '정보', '옷', '룩', '브랜드', '하나', '언니', '착용', '콜라보', '이번', '바지', '제품', '가요',
             '제', '코디', '포인트', '일', '할인', '겨울', '여름', '봄', '가을', '포인트', '사람', 'ㄷ', '실장', '생각', '전', '소개', '패션', '때',
             '듯', '저', '어디', '정도', '뉴', '소개', '창고', '세일', '부탁', '원', '껀', '할인', '러브', '사랑', '콜', '나', '먀치', '매치', '슈즈',
             '색', '주문', '기달', '리는', '구입', '핏', '거', '데', '니', '후기', '사용기', 'ㄴ', '체형', '튜버', '굿', '우리', '이게', '되네', '된다',
             '쇼핑', '온라인', '신경', '라인', 'ㅇㅋ', '퀄리티', '이벤트', '관리', '쌤', '마음', '사진', '건지', '가격', '작년', '올해', '매년', '은인', '정말',
             '배송', '평소', '힘', '머리', '점', '관심', '항목', '준수', '모습', '한국', '외국', '기장', '끝', '설명', '방법', '남', '소리', '개', '센스', '빠',
             '조', '자체', '나미', '크림', '여성', '남성', '색감', '롱', '지갑', '상', '기본', '셋', '시작', '부담', '장', '등', '컨텐츠', '매력', '터', '채널',
             '유튜브', '구독', '구독자', '응원', '이상', '도움', '엘더', '신사', '윌', '예전', '디', '랩', '편', '광자', '눈', '맛', '만족', '여기', '덕분', '내',
             '위', '필요', '모자', '상의', '하의', '신발', '장갑', '키', '댓글', '기대', '얼굴', '여', '걸', '모델', '최고', '존', '존나', '건가요', '시즌', '개인',
             '취향', 'ㅋ', '맞', '유행', '이쁘', 'ㅎ ㅎ', '사랑', '못', '최', '애', '짱', '지금', '착장', '다른', '근데', '라고', '년', '울', '닿', '당', '어떻게',
             '품절', '살', '죠', '어울리', '길', '뭐', '트', '진', '유', '두', '특히', '폼', '멋', '다니', '대', '셔서', '랜트', '맘', '의', '은', '들', '는', '과',
             '하다', '하', '을', '고', '좋', '님', '영상', '지', '보', '게', '주', '했', '번', '아', '만', '구매', '한다', '에', '로', '으로', '형', '어요',
             '수', '것', '진짜', '합니다', '을까요', '알', '적', '어', '같', '넘', '더', '추천', '네', '사', '할', '싶', '감사', '오늘', '나요', '어서', '아요', '서',
             '지만', '보이', 'ㅎㅎ', '겠', '면', '습니다', '되', '에서', '라', '도', '았', '해', '다고', '된', '세요', '어떤', '느낌', '인데', '해요', '려고', '후',
             '는데', '요즘', '안', '않', '면서', '주고', '같은', '아서', '다면', '아직', '되어', '다시', '다가', '아는', '네요', '니까', '다는', '입니다', '어도', '다니',
             '던', '세', '된다', '요', '와', '라는', '게', '이', '다', '아야', '이다', '랑', '에서는', '라면', '라도', '이나', '아도', '나서', '되는', '되도록', '아라',
             '든', '이라', '요', '되고', '신', '도록', '어라', '거나', '니', '래', '된', '되어', '서는', '보다', '여', '되면', '게요', '습니다', '라서', '리', '대한', '어야',
             '다고', '에서도', '이라고', '해도', '해서', '죠', '주는', '주신', '든지', '나도', '요', '와도', '보이는', '주시', '도다', '되서', '도의', '이라는', '해서도', '아이',
             '이라면', '되지', '주어', '에서의', '아서도', '라든지', '에서만', '도로', '되도록이면', '이야', '이었다', '보아', '되는데', '되게', '이라도', '라도', '더라도', '이서', '되냐',
             '되지만', '게서', '이라서', '가도', '되어서', '아이고', '에서라도', '되어야', '아래서', '되었다', '서도', '되어도', '리라', '라곤', '에서나', '나아', '서라', '라', '주', '되',
             '니', '이', '입니다', '세요', '네요', '요', 'ㅎ', 'ㅋ', '컬러', '다고', '사이즈', '입', '에서', '다는', '해요',
             '카페', '옷걸이', '홍', '결제', '띠', '요청', '여자', '남자', '유니클로', '토', '노이어', '몸매', '다스', '리셀',
             '동안', '홈페이지', '홈패이지', '학생', '창', '댓', '앤더슨', '히든', '퍼', '칼', '웻', '팔', '당첨자', '독특', '오프닝', '이미지', '축하'
             '지디', '신뢰', '심', '상승', '꽁', '편안', '널', '금전', '웨이', '중반', '운', '망', '등장', '세대', '어른', '시절', '이너', '무드', '등장', '플리', '폴리', '에스테르', '옷감', '면',
             '명향력', '상황', '콜리', '그리', '크리', '근본', '마이크', '공유', '돼지', '하체', '겉옷', '분도', '저기', '코코넛', '배기', '오피스',
             '상체', '오빠', '언니', '동생', '나', '너', '님', '왜', '크기', '톰', '턱', '틱',
             '택', '안녕', '하세요', '해요', '까요', '극', '어마', '아시아', '동아시아', '서양', '찌', '발란스', '부산', '구간', '라이', '나일론', '실밥', '모임', '지퍼', '와이드', '묵', '찌', '빠',
             '동양', '유럽', '극', '분노', '행복', '좋아', '좋지', '않', '해', '허', '만', '시청자', '트러블', '도용',
             '급식', '공구', '익스프레스', '토니', '중독', '밸런스', '브리', '조크', '실례', '연기', '맞음', '지디', '거짓말',
             '바다', '샤넬', '브렌드', '브랜드', '처리', '의미', '롤', '룰', '그게', '뭐', '뭐임',
             '시청', '별', '축하', '메', '뱃', '도매', '도메', '웨어', '해주', '소화력', '아시', '수정', '깨죽', '셀', '샐', '아스', '볼드', '볼트', '사카이', '농담', '쌀', '보테', '오타', '루', '아이브', '케이블', '월급', '주급', '연봉', '의사', '변호사', '회장', '아저씨',
             '힙', '향', '혜인', '브렌', '감성', '코어', '쿠어', '사향', '왕발', '다리', '지드래곤', '오디션', '측정기',
             '주세', '공부', '재미', '웩', '이해', '리스트', '세계', '세미', '메종', '사고', '스타일링', '스타일', '사건',
             '주식', '코인', '급증', '너도', '나도', '유행', '인기', '패션', '개', '나', '소', '음', '응', '야', '뭐',
             '이걸', '붕괴', '대대', '색깔', '타협', '프로필', '거인', '에피소드', '논쟁', '우파', '크루', '시보리', '구매처', '데이트', '나인', '기여', '니티', '플랫', '귀여', '아란', '이란', '아식스', '수형', '쵸', '맞춤', '행동', '신랑', '신부',
             '전이나', '지금이나', '디자이너들이', '좋아하는', '키는', '변함이', '없네요', '라이브도', '최고였음',
             '이어도', '상하체', '비율이', '문제인', '경우가', '있죠', '그래서', '오빠가', '바로', '이상적인', '키라는',
             '주우재도', '넘어', '보이는데', 'ㅋㅋㅋㅋㅋ', '겁나', '거인이던', 'ㅋㅋㅋㅋ', '큰', '애들끼리의', '궁금했는데', '재미있게', '썰', '풀어서', '웃김',
             '놈', '합', '오프라인', '자막', '몸무게', '가슴', '인정', '옴므', '눈물', '똥', '보단', '자크', '유명', '인세', '해결', '플레이', '무리', '부족', '최저', '누나',
             '추', '유니폼', '품', '낫', '브릿지', '겨', '데일리', '아재', '최저', '일부', '기재', '천재', '안감', '위주', '움', '옴', '오프', '아재', '솔', '뚜', '위주',
             '레', '용기', '사장', '백화점', '옵션', '스', '신고', '고정', '겁니다', '프린팅', '오픈', '용기', '특유', '실패', '더비', '사기', '축', '생활', '컨셉', '연락', '화장', '선정',
             '순간', '텐션', '실용', '상하', '흑청', '후반', '연락', '화장', '역대', '떡', '가족', '역대', '도전', '최대', '대부분', '금', '달러', '굽', '대부분', '저게', '포함', '감탄', '평가', '톤', '소매',
             '다행', '나용', '나요', '나욤', '하시', '나름', '당신', '취소', '야드', '겐', '닷', '번이', '카피', '느', '철학', '앞머리', '스토어', '수준', '남친', '참석', '태', '담',
             '라이더', '베이직', '품명', '마원', '자리', '활영', '겟', '출시', '혜택', '외모', '누구', '욕', '먹은', '외', '활동', '민', '아저씨', '여기저기', '딸', '케이스', '뎅',
             '밤', '주머니', '액', '잡채', '이후', '모양', '클럽', '살로몬', '결혼', '화', '잉', '유니크', '통', '소개팅', '억', '그때', '우마', '발견', '림', '학교', '우먼',
             '눈길', '눈', '길', '저희', '너희', '들', '나', '너', '얘', '얘기', '예', '사도', '상세', '남편', '징', '디스', '목록', '쓰', '레기', '재입', '입고', '배우',
             '시대', '사도', '종', '풀', '폴', '중', '림', '윈터', '인간', '성공', '손민수', '중국', '미국', '한국', '순위', '대로', '데로', '하는데', '스튜디오', '특별',
             '킴', '노래', '연예인', '엠', '홀리', '인기', '가요', '무대', '장난', '현대', '실', '득', '단점', '장점', '화면', '시대', '조던', '종료', '착화', '젼', '화',
             '애정', '촌', '통', '퉁', '통통', '뚱뚱', '뚱', '똥', '여기저기', '플래닛', '공대', '공개', '직업', '작업', '한국인', '타투', '아티스트', '가수', '미술', '대생',
             '이랑', '딕션', '위치', '취권', '메리노', '등급', '판단', '스트릿', '증발', '대딘', '오사카', '출발', '등급', '판단', '메리노', '네영', '내', ' 출발', '오사카',
             '카테고리', '레터링', '물가', '개선', '녹음', '사운드', '방식', '촬영', '유료', '방식', '레온', '도르', '씹', '청조', '온도', '택시', '차이', '신호등', '일본인', '대운', '덩치',
             '토르', '다', '입니다', '합니', '합니다', '혼방', '먹방', '터치', '목', '도둑', '디젤', '아울렛', '아울랫', '투어', '신혼', '라스베가스', '아울렛', '행사', '래퍼', '모크', '텍', '택',
             '임진', '무긍무진', '발전', '발열', '열', '땐', '때', '네이버', '숨', '개월', '이젠', '비즈니스', '어이', '어', '아', '내', '나의', '너의', '저희', '우리', '믿음', '레저드', '애청',
             '증정', '소감', '기대감', '경품', '에코', '애코', '발표', '공지', '자정', '등록', '타인', '비방', '욕설', '비속어', '쾌감', '운영', '저해', '통보', '삭제',
             '에코', '그램', '심장', '세련', '조지', '심장', '통장', '패브릭', '태그', '하단', '상단', '스크롤', '스크룰', '롤', '룰', '빵', '기달', '기다림', '설레임', '사랑',
             '커스텀', '실루엣', '아우', '예', '예시', '샘플', '예를', '들어', '대리', ' 안목', '추구', '미우미우', '미우', '웨스턴', '다니엘', '군', '마',
             '걸까', '춤', '종이', '중이', '탱', '듬', '함', '옹', '웅', '응', '크로스', '땐', '밍', '무시', '땅', '밍', '피스', '인형', '문의', '틀', '입', '원대',
             '이것저것', '이것', '저것', '것', '마틴', '감각', '금액', '액수', '메뉴얼', '매뉴얼', '진주', '오후', '오전', '투자', '월일', '월', '일', '요일', '시간', '친절', '예약', '선호',
             '마르지', '쏘', '파', '케트', '호', '극', '갠', '계열', '전문가', '특징', '허벅지', '밥', '맛', '입', '답', '도', '섬', '차', '대신', '이즈', '일상', '기억', '이제',
             '떡', '떡볶이', '김치', ' 핫', '예약', '영향력', '특징', '프리미엄', '싱', '에이', '특징', '검', '밤', '최종', '결과', '결말', '어떻', '떻', '어떻게', '젠', '잰', '전화', '폰',
             '핸드', '핸드폰', '인스', '인스타', '사진', '이즈', '유스', '샤먼', '유스', '직장', '커뮤니티', '커뮤', '인증', '전화', '손', '엑스', '튜', '표정', '라지', '미들', '미디움', '미디어',
             '성장', '직장인', '회사', '집', '거리', '인기', '대신', '벨리', '로제', '싱', '무채색', '간지', '답', '멋쟁이', '쟁이', '생김', '설탕', '달', '달달', '스토리', '결말', '강조', '닝',
             '대표', '사면', '마르지', '호', '대표', '땜', '선호', '기억', '게임', '게이', '로봇', '승리', '주접', '떤다', '떨', '추위', '계절', '더위', '바람', '찬', '광', '광기',
             '이렇게', '사람이', '그래요', '그래', '하', '입다', '벗다', '조깅', '단순', '주심', '성', '튜브', '완', '위크', '션', '보관', '시드', '원래', '방품', '삶', '살', '교복', '선착순', '애기',
             '삿', '요번', '방문', '수업', '유지', '초코', '구매쳐', '비닐', '깔', '찜', '옆집', '공', '셈', '주소', '연', '하늘', '슈프림', '상태', '원래', '부작용', '시장', '바닥', '상승',
             '꼴', '꼴에', '추위', '춥다', '개', '단순', '개', '강아지', '게', '세터', '난리', '트렌드', '트랜드', '브라', '수술', '트렌디', '미드', '한별', '커플', '집착', '뮤어',
             '윙', '웡', '모드', '자유', '머핀', '스퀘어', '미니', '바나나', '변환', '미미', '공주', '개성', '수아레', '수아래', '레몬', '블링', '반짝', '기다', '빠름',
             '중년', '지원', '지식', '그것', '미나', '노래', '신선', '고기', '비타민', '총장', '사탄', '판', '거울', '발렌시아가', '아디다스', '나이키', '입지', '구찌', '장르', '오트밀', '닐리,',
             '명품', '빛', '문선', '가성', '진스', '천주교', '생지', '감동', '와인', ' 카라', '내려라', '올려라', '추천', '가야지', '갈레', '갈래', '할래', '할레',
             '보관', '피지컬', '멘탈', '교육', '둘레', '버터', '왕자', '딥', '악마', '앙마', '흑', '흑흑', '감정', '표현', '잉잉', '잉', '앙', '양', '성인', '값', '셀렉', '일자', '맥',
             '효', '대학생', '안쪽', '자', '쥬', '트랩', '쥬', '버킷', '스캇', '자랑', '표기', '저걸', '홈', '흠', '닼', '궁', '골반', '타입', '조셉', '범고래', '고래', '핫', '성인', '뼈', '특가',
             '포장', '동일', '연말', '잠', '베', '표기', '까지', '가치', '추억', '미디', '주말', '한정', '부모', '선정', '결정', '판단', '호불호', '불호', '절', '보정', '절대', '마감',
             '자사', '앵', '대체', '조금', '쪼금', '쵸금', '결국', '결말', '짜샤', '짜식', '자식', '님', '님아', '효', '요', '엡', '예압', '마인드', '값', '오랫동안', '옛날', '에', '을',
             '들', '를', '왜', '뭐', '모', '무', '쳤다', '쳤', '침', '취', '누', '지속', '주기', '알고리즘', '스타일리스트', '메모', '매모', '고객', '호갱', '신어', '신조', '틀', '엠쥐', '지',
             '안목', '스스', '후회', '파리', '파라', '우산', '공간', '한정', '발목', '결국', '이야기', '노래', '코인', '방', '우주', '영화', '쇼핑', '한정', '세일', '특가'
             ]

# 불용어 뒤에 띄어쓰기 있는것 까지 같이 추가해서 제거
new_stopwords = []
for word in stopwords:
    new_stopwords.append(word + ' ')
    new_stopwords.append(word)
    new_stopwords.append(' ' + word)
    new_stopwords.append(' ' + word + ' ')
rows = select_query(['title', 'comments'])
# 댓글은 문자열 형태이다...
# 제목도 문자열 형태이다.
# 영상당 하나는 튜플 형태이다. 그러니깐 튜플 하나에 문자열 형태 2개의 원소가 존재한다.

# DB에 저장되어 있는 데이터 가져다가 딕셔너리 형태로 만들기
data_list = []
for tuple in rows:
    title = tuple[0]
    comment_list = tuple[1].replace("{", "").replace("}", "").split('","')
    comment_list[0] = comment_list[0].replace('"', '')

    dic = {}
    dic['title'] = title
    dic['comments'] = comment_list

    data_list.append(dic)


# <<<<<<<<<클렌징>>>>>>>>>>>>
# 1. 특수문자, 외국어 제거


# 정규식을 이용해서 한글, 공백(띄어쓰기 한칸)를 제외하고 모두 제거하기
def clean_text(text):
    cleaned_text = re.sub("[^가-힣ㄱ-ㅎㅏ-ㅣ ]", "", text)
    cleaned_text = re.sub("\s+", " ", cleaned_text)  # 연속된 공백을 하나로 축소
    return cleaned_text

# 위 정규식을 거치고 나면 텅텅 비어 있는 값 '', 혹은 공백만 있는 값들이 있을 수 있음
# 이 값들도 제거하는 정규식 => '^\s*$'


# 반복문으로 데이터 정리
for data in data_list:
    data['title'] = clean_text(data['title'])
    if re.match(r'^\s*$', data['title']):
        data['title'] = ''

    for i, comment in enumerate(data['comments']):
        data['comments'][i] = clean_text(comment).strip()

# print(data_list[-1]['comments'][0])


comments_list = []
for one_video in data_list:
    for comments_of_one in one_video['comments']:
        # print(comments_of_one)
        if comments_of_one != '':
            comments_list.append(comments_of_one)


time3 = time.time()

# 띄어쓰기 정규화하기
spacing = Spacing()
normarlized_comments = []
for comment in comments_list:
    normal_str = spacing(comment)
    print(normal_str)
    normarlized_comments.append(normal_str)

time4 = time.time()
print('띄어쓰기 정규화 하는데 걸린 시간:', time4 - time3)


# 위에서 정규화한 리스트들 파일형태로 저장
# 파일로 저장
with open("output.txt", "w", encoding="utf-8") as file:
    for string in normarlized_comments:
        file.write(string + "\n")  # 각 문자열 뒤에 줄바꿈 문자 추가


# 여러 키워드를 포함하는 댓글 찾기


def filter_comments_by_keywords(comments, keywords):
    filtered_comments = []
    for comment in comments:
        for keyword in keywords:
            if keyword in comment:
                filtered_comments.append(comment)
                break  # 이미 한 키워드에 해당하면 다른 키워드 검사하지 않음
    return filtered_comments


def not_in_keywords(comments, keywords):
    no_items = []
    for comment in comments:
        if not all(keyword in comment for keyword in keywords):
            no_items.append(comment)
    return no_items

# 키워드를 포함하는 댓글 필터링


tops_words = ['니트', '셔츠', '상의', '티', '티셔츠', '스웨터', '남방', '목폴라', '폴라']
top_comments = filter_comments_by_keywords(normarlized_comments, tops_words)

bottoms_words = ['스커트', '슬랙스', '슬렉스', '치노',
                 '바지', '조거', '청바지', '치마', '팬츠', '하의']
bottom_comments = filter_comments_by_keywords(
    normarlized_comments, bottoms_words)

shoes_words = ['구두', '운동화', '로퍼', '힐', '스니커즈', '슬리퍼', '샌드', '부츠', '신발']
shoes_comments = filter_comments_by_keywords(
    normarlized_comments, shoes_words)

outer_words = ['패딩', '코드', '자켓', '무스탕', '바람막이', '잠바', '아우터', '오리털', '다운덕', '덕']
outerwear_comments = filter_comments_by_keywords(
    normarlized_comments, outer_words)

accessory_words = ['목걸이', '모자', '안경', '시계', '팔찌', '반지', '목도리', '악세', '악세사리']
accessory_comments = filter_comments_by_keywords(
    normarlized_comments, accessory_words)

all_items = tops_words + bottoms_words + \
    shoes_words + outer_words + accessory_words
not_fashion_items_comments = not_in_keywords(normarlized_comments, all_items)

print(len(top_comments))
print(len(bottom_comments))
print(len(shoes_comments))
print(len(outerwear_comments))
print(len(accessory_comments))
print(len(not_fashion_items_comments))

# 각 카테고리별 댓글 리스트
# 예: top_comments = ['댓글1', '댓글2', ...]

# 각 카테고리별 댓글을 데이터프레임으로 변환
df_top = pd.DataFrame({'comment': top_comments, 'label': 0})
df_bottom = pd.DataFrame({'comment': bottom_comments, 'label': 1})
df_outerwear = pd.DataFrame({'comment': outerwear_comments, 'label': 2})
df_shoes = pd.DataFrame({'comment': shoes_comments, 'label': 3})
df_accessory = pd.DataFrame({'comment': accessory_comments, 'label': 4})
df_not_fashion_items = pd.DataFrame(
    {'comment': not_fashion_items_comments, 'label': 5})


# 모든 데이터프레임 결합
df_combined = pd.concat(
    [df_top, df_bottom, df_outerwear, df_shoes, df_accessory, df_not_fashion_items], ignore_index=True)


# 빈도수 낮은 단어들을 찾기 위한 토큰화 과정
mecab = MeCab()
temp = []
for sentence in df_combined['comment']:
    temp_X = mecab.morphs(sentence)
    temp_X = [word for word in temp_X if not word in new_stopwords]  # 불용어 제거
    temp.append(temp_X)


# Tokenizer 정의 및 훈련
tokenizer = Tokenizer()
tokenizer.fit_on_texts(temp)

# 단어 빈도수 계산
threshold = 15
total_cnt = len(tokenizer.word_index)  # 전체 단어 수
rare_cnt = 0  # 빈도수가 기준 이하인 단어 수
rare_freq = 0  # 기준 미만의 단어 빈도수 총합

for key, value in tokenizer.word_counts.items():
    if value < threshold:
        rare_cnt += 1
        rare_freq += value

print('전체 단어 수:', total_cnt)
print('빈도수가 {}번 미만인 희귀 단어 수: {}'.format(threshold, rare_cnt))
print('희귀 단어 비율: {:.2f}%'.format((rare_cnt / total_cnt) * 100))
print('희귀 단어 등장 비율: {:.2f}%'.format(
    (rare_freq / sum(tokenizer.word_counts.values())) * 100))

# 희귀 단어를 제외한 단어 사전 생성
vocab_size = total_cnt - rare_cnt


# 정규화까지 진행된 댓글리스트를 다시 가져와서 0~4까지 분류
temp_2 = []
for sentence in df_combined['comment']:
    temp_X = mecab.morphs(sentence)
    temp_X = [word for word in temp_X if not word in new_stopwords]  # 불용어 제거
    temp_2.append(temp_X)


tokenizer = Tokenizer(num_words=vocab_size)
tokenizer.fit_on_texts(temp_2)

# 텍스트 시퀀스를 정수 시퀀스로 변환
sequences = tokenizer.texts_to_sequences(temp_2)

# 패딩
max_sequence_length = 150
padded_sequences = pad_sequences(sequences, maxlen=max_sequence_length)


# 레이블 추출
labels = df_combined['label'].values


# 모델 구축

model = Sequential()
model.add(Embedding(input_dim=5000, output_dim=128,
          input_length=max_sequence_length))
model.add(Bidirectional(LSTM(128, dropout=0.2, recurrent_dropout=0.2)))
model.add(Dense(6, activation='softmax'))  # 5개의 출력 클래스

# 모델 컴파일
model.compile(loss='sparse_categorical_crossentropy',
              optimizer='adam', metrics=['accuracy'])


# 훈련 데이터와 테스트 데이터 분리
X_train, X_test, y_train, y_test = train_test_split(
    padded_sequences, labels, test_size=0.20, random_state=42)


# 모델 학습
model.fit(X_train, y_train, batch_size=32, epochs=10,
          validation_data=(X_test, y_test))

# 모델을 HDF5 파일로 저장
model.save("classfy_model.h5")


# # 저장된 모델 로드
# loaded_model = load_model("classfy_model.h5")


# # 댓글에 대한 예측 수행
# predictions = loaded_model.predict(padded_sequences)
# predicted_labels = np.argmax(predictions, axis=1)

# # 예측 결과를 데이터프레임으로 변환
# classified_comments_df = pd.DataFrame({
#     'comment': normarlized_comments,
#     'label': predicted_labels
# })


# print(classified_comments_df)


# conn = get_db_connection()
# # Pandas DataFrame을 PostgreSQL 테이블에 삽입하는 함수


# def copy_from_stringio(conn, df, table):
#     """
#     데이터프레임을 문자열 버퍼로 변환하고 SQL COPY 명령을 사용하여 PostgreSQL 테이블에 삽입
#     """
#     # 문자열 버퍼 생성
#     buffer = StringIO()
#     df.to_csv(buffer, index=False, header=False)
#     buffer.seek(0)

#     # PostgreSQL 삽입을 위한 커서 생성
#     cursor = conn.cursor()

#     try:
#         # COPY 명령 실행
#         cursor.copy_from(buffer, table, sep=",", columns=df.columns)
#         conn.commit()
#     except (Exception, psycopg2.DatabaseError) as error:
#         print("Error: %s" % error)
#         conn.rollback()
#         cursor.close()
#         return 1
#     print("Data inserted successfully")
#     cursor.close()


# # 데이터프레임을 PostgreSQL 테이블에 삽입
# copy_from_stringio(conn, classified_comments_df, 'classified_comments')
