# -*- coding: utf-8 -*-

from wordcloud import WordCloud
import matplotlib as mpl
import squarify
import numpy as np
from mecab import MeCab
from DB_retriever import select_normalized
import pandas as pd
from konlpy.tag import Mecab
from tensorflow.keras.preprocessing.text import Tokenizer
from tensorflow.keras.preprocessing.sequence import pad_sequences
from collections import Counter
import matplotlib.pyplot as plt

# 띄어쓰기 정형화 된 것들 다시 불러와서 데이타프레임으로 저장
rows = select_normalized(['title', 'comments'])
df = pd.DataFrame(rows, columns=['Title', 'Comments'])


# 다시 이어서 토큰화 진행
stopwords = ['고급', '다음', '랜드', '템', '때문', '용', '집', '소재', '찰떡', '힘', '리뷰', '맛집', '리뷰', '후기', '마지막', '고민', '행복', '광고', '상품', '사용', '운동', '조합', '시간', '링크', '활용', '완전', '부분', '너', '인', '마지막', '시간', '미친', '갓', '말', 'ㅈ', '같은', '색상', '업', '오', '중', '앞', '뭔가', '디자인', '가장', '분', '스타일', '깡', '건', '랜듯', '쿠폰', '가능', '아이템', '디테일', '템;', '돈', '진심', '정보', '옷', '룩', '브랜드', '하나', '언니', '착용', '콜라보', '이번', '바지', '제품', '가요', '제', '코디', '포인트', '일', '할인', '겨울', '여름', '봄', '가을', '포인트', '사람', 'ㄷ', '실장', '생각', '전', '소개', '패션', '때', '듯', '저', '어디', '정도', '뉴', '소개', '창고', '세일', '부탁', '원', '껀', '할인', '러브', '사랑', '콜', '나', '먀치', '매치', '슈즈', '색', '주문', '기달', '리는', '구입', '핏', '거', '데', '니', '후기', '사용기', 'ㄴ', '체형', '튜버', '굿', '우리', '이게', '되네', '된다', '쇼핑', '온라인', '신경', '라인', 'ㅇㅋ', '퀄리티', '이벤트', '관리', '쌤', '마음', '사진', '건지', '가격', '작년', '올해', '매년', '은인', '정말', '배송', '평소', '힘', '머리', '점', '관심', '항목', '준수', '모습', '한국', '외국', '기장', '끝', '설명', '방법', '남', '소리', '개', '센스', '빠', '조', '자체', '나미', '크림', '여성', '남성', '색감', '롱', '지갑', '상', '기본', '셋', '시작', '부담', '장', '등', '컨텐츠', '매력', '터', '채널', '유튜브', '구독', '구독자', '응원', '이상', '도움', '엘더', '신사', '윌', '예전', '디', '랩', '편', '광자', '눈', '맛', '만족', '여기', '덕분', '내', '위', '필요', '모자', '상의', '하의', '신발', '장갑', '키', '댓글', '기대', '얼굴', '여', '걸', '모델', '최고', '존', '존나', '건가요', '시즌', '개인', '취향', 'ㅋ', '맞', '유행', '이쁘', 'ㅎ ㅎ', '사랑', '못', '최', '애', '짱', '지금', '착장', '다른', '근데', '라고', '년', '울', '닿', '당', '어떻게', '품절', '살', '죠', '어울리', '길', '뭐', '트', '진', '유', '두', '특히', '폼', '멋', '다니', '대', '셔서', '랜트', '맘', '의', '은', '들', '는', '과', '하다', '하', '을', '고', '좋', '님', '영상', '지', '보', '게', '주', '했', '번', '아', '만', '구매', '한다', '에', '로', '으로', '형', '어요',
             '수', '것', '진짜', '합니다', '을까요', '알', '적', '어', '같', '넘', '더', '추천', '네', '사', '할', '싶', '감사', '오늘', '나요', '어서', '아요', '서', '지만', '보이', 'ㅎㅎ', '겠', '면', '습니다', '되', '에서', '라', '도', '았', '해', '다고', '된', '세요', '어떤', '느낌', '인데', '해요', '려고', '후', '는데', '요즘', '안', '않', '면서', '주고', '같은', '아서', '다면', '아직', '되어', '다시', '다가', '아는', '네요', '니까', '다는', '입니다', '어도', '다니', '던', '세', '된다', '요', '와', '라는', '게', '이', '다', '아야', '이다', '랑', '에서는', '라면', '라도', '이나', '아도', '나서', '되는', '되도록', '아라', '든', '이라', '요', '되고', '신', '도록', '어라', '거나', '니', '래', '된', '되어', '서는', '보다', '여', '되면', '게요', '습니다', '라서', '리', '대한', '어야', '다고', '에서도', '이라고', '해도', '해서', '죠', '주는', '주신', '든지', '나도', '요', '와도', '보이는', '주시', '도다', '되서', '도의', '이라는', '해서도', '아이', '이라면', '되지', '주어', '에서의', '아서도', '라든지', '에서만', '도로', '되도록이면', '이야', '이었다', '보아', '되는데', '되게', '이라도', '라도', '더라도', '이서', '되냐', '되지만', '게서', '이라서', '가도', '되어서', '아이고', '에서라도', '되어야', '아래서', '되었다', '서도', '되어도', '리라', '라곤', '에서나', '나아', '서라', '라', '주', '되', '니', '이', '입니다', '세요', '네요', '요', 'ㅎ', 'ㅋ', '컬러', '다고', '사이즈', '입', '에서', '다는', '해요']

tagger = MeCab()

title_tokened = []
for comments in df['Comments']:
    for comment in comments:
        title_tokened.extend([word for word in tagger.nouns(
            comment) if not word in stopwords])

print(title_tokened)

# 빈도수 검사
title_counter = Counter(title_tokened)
top_title_counter = dict(title_counter.most_common(2000))
print(top_title_counter)


# 워드클라우드로 시각화
wc = WordCloud(font_path='/Library/Fonts/AppleGothic.ttf')

wc.generate_from_frequencies(top_title_counter)
figure = plt.figure(figsize=(15, 15))
ax = figure.add_subplot(1, 1, 1)
ax.axis('off')
ax.imshow(wc)
plt.show()


colors_korean = [
    "검정", "흰색", "빨간색", "파란색", "초록색", "노란색",
    "핑크색", "보라색", "주황색", "회색", "베이지색", "갈색",
    "남색", "금색", "은색", "버건디", "카키", "라벤더",
    "민트", "아쿠아", "터쿼이즈", "코랄", "인디고", "밤색",
    "살구색", "캐러멜", "탠", "올리브", "복숭아", "상아",
    "체리", "자두", "머스터드", "물오리", "로즈골드", "매젠타",
    "샴페인", "코발트", "버터", "카르디널", "플러밍고", "리벳",
    "루비", "토파즈", "사파이어", "에메랄드", "아메더스", "자스민",
    "카넬리안", "아쿠아마린", "퍼선", "펄", "오팔", "티타늄",
    "백금", "라일락", "크림", "초코렛", "마블", "황금",
    "머랭", "에스프레소", "파스텔", "블러쉬", "바이올렛", "샌드",
    "에보니", "메로", "잠버린", "탄저린", "모카", "캔버라",
    "퓨터", "브론즈", "아이보리", "펄그레이", "캐머런", "크림소다",
    "헤이즐넛", "휘그", "코코아", "로즈", "리치", "피스타치오",
    "오렌지", "바닐라", "피터팬", "블루베리", "와인", "헤더",
    "그린티", "포도", "라임", "스트로베리", "멜론", "레몬",
    "카푸치노", "라즈베리", "프룬", "애프리콧", "피크닉", "핫핑크",
    "체리블러썸", "선셋", "아이스블루", "퍼플레인", "마호가니", "허니",
    "쿠키", "카라멜", "페퍼민트", "아이스크림", "마키아또", "라떼",
    "포레스트", "모스그린", "마린블루", "스카이", "오션", "티트리",
    "허브", "라이트그린", "데이지", "로즈페탈", "페리", "애플그린"
]
