{"\ud2f0\uc154\uce20": 1, "\uc2a4\uc6e8\ud130": 2, "\ube14\ub77c\uc6b0\uc2a4": 3, "\uba74": 4, "\ud2f0": 5, "\uc154\uce20": 6, "\ud6c4\ub4dc": 7, "\uce74\ub514\uac74": 8, "\ub2c8\ud2b8": 9, "\uc708\ub4dc": 10, "\uc2a4\ud1a0\ud37c": 11, "\uc870\ub07c": 12, "\ub4dc\ub808\uc2a4": 13, "\ubaa9": 14, "\ud3f4\ub77c": 15, "\ud130\ud2c0": 16, "\ub125": 17, "\uae30\ubaa8": 18, "\uc625\uc2a4\ud3ec\ub4dc": 19, "\uc26c\ud504\ud2b8": 20, "\uc9d1\uc5c5": 21, "\ub098\uc2dc": 22, "\ub9e8": 23, "\ud22c\ub9e8": 24, "\ub0a8\ubc29": 25, "\ud558\ud504": 26, "\uc9e7\uc740": 27, "\uae34": 28, "\ud314": 29, "\uc0c1\uc758": 30, "\uc624\ubc84": 31, "\uc0ac\uc774\uc988": 32, "\ubc14\ub514": 33, "\ucf58": 34, "\uc5b8": 35, "\ub354": 36, "\ubc18": 37, "\ub9b0\ub128": 38, "\ud480": 39, "\ud3f4\ub85c": 40, "\uc640\uc774\uc154\uce20": 41, "\ud0d1": 42, "\ubbfc\uc18c\ub9e4": 43, "\ub3cc": 44, "\ubcfc\ub808\ub85c": 45, "\uae30\ubcf8": 46, "\ub7f0\ub2dd\uad6c": 47, "\ubc15\uc2a4": 48, "\ud06c\ub86d": 49, "\uc2a4\uc6fb\ud130": 50, "\ud53c\ucf00": 51, "\ud6c4\ub514": 52, "\uc218\ud2b8": 53, "\uc800\uc9c0": 54, "\ub370\ub2d8": 55, "\ud0f1\ud06c": 56, "\ud0f1\ud06c\ud0d1": 57, "\ud06c\ub86d\ud0d1": 58, "\ud3f4\ub85c\uc154\uce20": 59, "\ubca0\uc2a4\ud2b8": 60, "\ud130\ud2c0\ub125": 61, "\uc625\uc2a4\ud37c\ub4dc": 62, "\ub808\uc774": 63, "\uc2a4\ud0d1": 64, "\uccad\ubc14\uc9c0": 65, "\uc2ac\ub799\uc2a4": 66, "\ud398\uadf8\ub4dc": 67, "\ud32c\uce20": 68, "\uce58\ub178": 69, "\ud03c": 70, "\ub85c\ud2b8": 71, "\uc2a4\ucee4\ud2b8": 72, "\ubc14\uc9c0": 73, "\ud558\uc758": 74, "\uc2a4\ud0c0\ud0b9": 75, "\ud2b8\ub808\uc774\ub2dd\ubcf5": 76, "\ubc30\uae30": 77, "\ucf54\ub4c0": 78, "\ub85c\uc774": 79, "\uc2a4\ud0a4": 80, "\ub2c8": 81, "\ud050\ub86f": 82, "\uc20f": 83, "\ud56b": 84, "\uce04\ub9ac\ub2dd": 85, "\uce74": 86, "\uace0": 87, "\uce58\ub9c8": 88, "\ud14c\ub2c8\uc2a4": 89, "\uac00\uc8fd": 90, "\uc870\uac70": 91, "\uc2dc\ud2f0": 92, "\uc1fc\uce20": 93, "\uc640\uc774\ub4dc": 94, "\ub808\ub354": 95, "\ubd80\uce20": 96, "\ucef7": 97, "\ub2c8\ucee4\uc2a4": 98, "\ucee4\ud504": 99, "\ub4dc": 100, "\uac00\uc6b0\ucd08": 101, "\uace8\ub374": 102, "\uc2a4\ud2b8\ub808\uc774\ud2b8": 103, "\ubca8": 104, "\ubcf4\ud140": 105, "\ub808\uae45\uc2a4": 106, "\uce74\ud504\ub9ac": 107, "\ucee4": 108, "\uc988": 109, "\ub864": 110, "\ubc84\ubba4\ub2e4": 111, "\ub798\uae45\uc2a4": 112, "\uc790\ucf13": 113, "\ucf54\ud2b8": 114, "\ud2b8\ub80c\uce58": 115, "\ud328\ub529": 116, "\uc7ac\ud0b7": 117, "\ub178": 118, "\uce74\ub77c": 119, "\ubc14\ub78c\ub9c9\uc774": 120, "\ub808\uc778": 121, "\uc57c": 122, "\uc0c1": 123, "\uc544\uc6b0": 124, "\ud130": 125, "\ub355": 126, "\ub2e4\uc6b4": 127, "\ube14\ub8e8": 128, "\uc885": 129, "\uccad": 130, "\ubbf8\ub2c8": 131, "\uba40": 132, "\uce90\uc2dc\ubbf8\uc5b4": 133, "\ubca8\ubcb3": 134, "\uacbd\ub7c9": 135, "\ud004\ud305": 136, "\ub871": 137, "\ud2b8\ub80c\uce58\ucf54\ud2b8": 138, "\ud2b8\uc70c": 139, "\ud56d\uacf5": 140, "\uc810\ud37c": 141, "\ud2b8\ub7ec\ucee4": 142, "\ub9e5\uc2dc": 143, "\ub77c\uc774\ub354": 144, "\ube14": 145, "\ub808\uc774\uc800": 146, "\ud30c\uce74": 147, "\ubc14\ub78c": 148, "\ub9c9": 149, "\uc774": 150, "\uac00\ub514\uac74": 151, "\ubb34\uc2a4": 152, "\ud0d5": 153, "\ud03c\ud2b8": 154, "\ubf40\uae00\uc774": 155, "\ub871\ud328\ub529": 156, "\ub7f0\ub2dd\ud654": 157, "\ud558\uc774\ud790": 158, "\ud0ac": 159, "\ud790": 160, "\uc0cc\ub4e4": 161, "\ub85c\ud37c": 162, "\uc2a4\ub2c8\ucee4\uc988": 163, "\ud50c\ub7ab": 164, "\uc288\uc988": 165, "\uc6cc\ucee4": 166, "\uc2ac\ub9bd": 167, "\uc628": 168, "\uc2e0\ubc1c": 169, "\ucee8": 170, "\ubc84\uc2a4": 171, "\ub098\uc774\ud0a4": 172, "\uc544\ub514\ub2e4\uc2a4": 173, "\ud50c\ub808\uc778": 174, "\ud1a0": 175, "\uad70\ud654": 176, "\ucef4\ubc43": 177, "\uc2ac\ub9c1": 178, "\ubc31": 179, "\uc2a4\ud2b8\ub7a9": 180, "\ud50c\ub7ab\ud3fc": 181, "\uae00\ub798\ub514\uc5d0\uc774\ud130": 182, "\ubcf4\ud2b8": 183, "\ud0dc\uc2ac": 184, "\uba54\ub9ac\uc81c\uc778": 185, "\ub274\ubc1c\ub780\uc2a4": 186, "\uc7a5\ud654": 187, "\ud06c": 188, "\ub85d\uc2a4": 189, "\uc2ac\ub9ac\ud37c": 190, "\ud38c\ud504\uc2a4": 191, "\ud558\uc774": 192, "\uc5b4": 193, "\uae00\ub9ac": 194, "\ucf00": 195, "\uc96c\uc5bc": 196, "\uad6c\ub450": 197, "\ubabd\ud06c": 198, "\uc6e8\uc9c0\ud790": 199, "\uc0ad\uc2a4": 200, "\uc575": 201, "\ud074": 202, "\ucabc\ub9ac": 203, "\ud4e8\ub9c8": 204, "\ubbac": 205, "\ub098\ub9c9\uc2e0": 206, "\uc5d0\uc2a4": 207, "\ud30c": 208, "\ub4dc\ub9ac": 209, "\uc720": 210, "\ub354\ube44": 211, "\uc719\ud301": 212, "\ubaa8\uce74\uc2e0": 213, "\uc6b4\ub3d9\ud654": 214, "\ud301": 215, "\ubc34\ub4dc": 216, "\ubaa9\uac78\uc774": 217, "\uadc0\uac78\uc774": 218, "\ud314\ucc0c": 219, "\uc2dc\uacc4": 220, "\ubc18\uc9c0": 221, "\ud5e4\uc5b4": 222, "\uc120\uae00\ub77c\uc2a4": 223, "\uc2a4\uce74\ud504": 224, "\ucea1": 225, "\ubca8\ud2b8": 226, "\uc545\uc138\uc0ac\ub9ac": 227, "\uc545\uc138": 228, "\ube0c\ub85c\uce58": 229, "\ucee4\ud504\uc2a4": 230, "\ud1a0\ud2b8": 231, "\ud074\ub7ec\uce58": 232, "\ud329": 233, "\ud578\ub4dc\ubc31": 234, "\ubaa9\ub3c4\ub9ac": 235, "\ud074\ub9bd": 236, "\ub9c8\uc2a4\ud06c": 237, "\uc591\ub9d0": 238, "\ucf58\ud0dd\ud2b8": 239, "\ub80c\uc988": 240, "\uc548\uacbd": 241, "\uac00\ubc29": 242, "\ud5e4\ub4dc\ud3f0": 243, "\ud540": 244, "\ucee8\ud14d\ud2b8": 245, "\ub125\ud0c0\uc774": 246, "\ubcf4\uc11d": 247, "\ub124\uc77c": 248, "\uadc0": 249, "\uac78\uc774": 250, "\uc5f4": 251, "\uc1e0\uace0\ub9ac": 252, "\ud0a4\ub9c1": 253, "\ube7d": 254, "\ubaa8\uc790": 255, "\ud0c0\ud22c": 256, "\uc545\uc0c8": 257, "\ud5e4\ub098": 258, "\ube7d\ud329": 259, "\ud138": 260, "\uc7a5\uac11": 261, "\ucf58\ud0dd\ud2b8\ub80c\uc988": 262, "\uc544\ud2b8": 263, "\ubc99\uc5b4\ub9ac": 264, "\ud0c0\uc774": 265, "\uac70\ub9ac": 266}