{"\ud2f0\uc154\uce20": 1, "\uc2a4\uc6e8\ud130": 2, "\ube14\ub77c\uc6b0\uc2a4": 3, "\ud3f4\ub85c\uc154\uce20": 4, "\uc154\uce20": 5, "\ud6c4\ub4dc": 6, "\ud2f0": 7, "\uce74\ub514\uac74": 8, "\ub2c8\ud2b8": 9, "\uc870\ub07c": 10, "\ub4dc\ub808\uc2a4": 11, "\ubaa9": 12, "\ud3f4\ub77c": 13, "\uae30\ubaa8": 14, "\uc625": 15, "\uc2a4\ud3ec\uce20": 16, "\ub4dc": 17, "\uc9d1\uc5c5": 18, "\ud3f4\ub85c": 19, "\ud06c\ub86d\ud0d1": 20, "\ub0a8\ubc29": 21, "\ud558\ud504": 22, "\uc9e7\uc740": 23, "\uae34": 24, "\ud314": 25, "\uc0c1\uc758": 26, "\uc624\ubc84": 27, "\uc0ac\uc774\uc988": 28, "\ub370\ub2d8": 29, "\ud0f1\ud06c\ud0d1": 30, "\ubc18": 31, "\ub9b0\ub128": 32, "\uc640\uc774\uc154\uce20": 33, "\ud0d1": 34, "\ub098\uc2dc": 35, "\ub4dc\ub808\uc2a4\uc154\uce20": 36, "\uae30\ubcf8": 37, "\ub7f0\ub2dd\uad6c": 38, "\ud06c\ub86d": 39, "\uc2a4\uc6fb\ud130": 40, "\ud6c4\ub514": 41, "\uc800\uc9c0": 42, "\ud0f1\ud06c": 43, "\uccad\ubc14\uc9c0": 44, "\uc2ac\ub799\uc2a4": 45, "\uc20f": 46, "\ud32c\uce20": 47, "\uce58\ub178": 48, "\ub808\uae45\uc2a4": 49, "\uc2a4\ucee4\ud2b8": 50, "\ubc14\uc9c0": 51, "\ud558\uc758": 52, "\uc2a4\ud0c0\ud0b9": 53, "\ud2b8\ub808\uc774\ub2dd\ubcf5": 54, "\uace8\ub374": 55, "\ucf54\ub4c0": 56, "\ub85c\uc774": 57, "\uce74": 58, "\uace0": 59, "\uce04\ub9ac\ub2dd": 60, "\uce58\ub9c8": 61, "\ud14c\ub2c8\uc2a4": 62, "\uac00\uc8fd": 63, "\uc870\uac70": 64, "\uc2a4\ud0a4": 65, "\ub2c8": 66, "\uc640\uc774\ub4dc": 67, "\ub808\ub354": 68, "\uace8\ub374\ubc14": 69, "\uc9c0": 70, "\ub85c": 71, "\uc774\ubc14\uc9c0": 72, "\ucf54\ud2b8": 73, "\ud2b8\ub80c\uce58": 74, "\ud328\ub529": 75, "\uc7ac\ud0b7": 76, "\uc790\ucf13": 77, "\ube14": 78, "\ub808\uc774\uc800": 79, "\ud30c\uce74": 80, "\ubc14\ub78c\ub9c9\uc774": 81, "\ub808\uc778": 82, "\uc57c": 83, "\uc0c1": 84, "\uc544\uc6b0": 85, "\ud130": 86, "\ub355": 87, "\ub2e4\uc6b4": 88, "\ube14\ub8e8": 89, "\uc885": 90, "\uccad": 91, "\uce90\uc2dc\ubbf8\uc5b4": 92, "\ubca8\ubcb3": 93, "\ud03c\ud2b8": 94, "\ub871": 95, "\ud2b8\ub80c\uce58\ucf54\ud2b8": 96, "\ud56d\uacf5": 97, "\uc810\ud37c": 98, "\ud2b8\ub7ec\ucee4": 99, "\ub9e5\uc2dc": 100, "\ubc14\ub78c": 101, "\ub9c9": 102, "\uc774": 103, "\ub808\uc778\ucf54\ud2b8": 104, "\uac00\uc744": 105, "\ub871\ud328\ub529": 106, "\ub7f0\ub2dd\ud654": 107, "\ud558\uc774\ud790": 108, "\ud0ac": 109, "\ud790": 110, "\uc0cc\ub4e4": 111, "\ub85c\ud37c": 112, "\uc2a4\ub2c8\ucee4\uc988": 113, "\ud50c\ub7ab": 114, "\uc288\uc988": 115, "\uc6cc\ucee4": 116, "\uc2ac\ub9bd": 117, "\uc628": 118, "\uc2e0\ubc1c": 119, "\ucee8": 120, "\ubc84\uc2a4": 121, "\ub098\uc774\ud0a4": 122, "\uc544\ub514\ub2e4\uc2a4": 123, "\ud4e8\ub9c8": 124, "\uad70\ud654": 125, "\ubd80\uce20": 126, "\ucef4\ubc43": 127, "\ud38c\ud504\uc2a4": 128, "\uc2a4\ud2b8\ub7a9": 129, "\ud50c\ub7ab\ud3fc": 130, "\uae00\ub798\ub514\uc5d0\uc774\ud130": 131, "\uc9da\uc2e0": 132, "\ubaa8\uce74\uc2e0": 133, "\uc625\uc2a4\ud37c\ub4dc": 134, "\uba54\ub9ac\uc81c\uc778": 135, "\ub274\ubc1c\ub780\uc2a4": 136, "\uc7a5\ud654": 137, "\ud06c": 138, "\ub85d\uc2a4": 139, "\uc2ac\ub9ac\ud37c": 140, "\uad6c\ub450": 141, "\ud558\uc774": 142, "\ucf00": 143, "\uc96c\uc5bc": 144, "\ud50c\ub7ab\uc288\uc988": 145, "\ucabc\ub9ac": 146, "\ub098\ub9c9\uc2e0": 147, "\uc5d0\uc2a4": 148, "\ud30c": 149, "\ub4dc\ub9ac": 150, "\uc720": 151, "\ub274\ubc1c": 152, "\uc6b4\ub3d9\ud654": 153, "\ubaa9\uac78\uc774": 154, "\uadc0\uac78\uc774": 155, "\ud314\ucc0c": 156, "\uc2dc\uacc4": 157, "\ubc18\uc9c0": 158, "\ud5e4\uc5b4": 159, "\ubc34\ub4dc": 160, "\uc120\uae00\ub77c\uc2a4": 161, "\uc2a4\uce74\ud504": 162, "\ucea1": 163, "\ubca8\ud2b8": 164, "\uc545\uc138\uc0ac\ub9ac": 165, "\uc545\uc138": 166, "\ube0c\ub85c\uce58": 167, "\ucee4\ud504\uc2a4": 168, "\ud1a0\ud2b8": 169, "\ubc31": 170, "\ud074\ub7ec\uce58": 171, "\ud329": 172, "\ud578\ub4dc\ubc31": 173, "\ubaa9\ub3c4\ub9ac": 174, "\ud074\ub9bd": 175, "\ub9c8\uc2a4\ud06c": 176, "\uc591\ub9d0": 177, "\ucf58\ud0dd\ud2b8": 178, "\ub80c\uc988": 179, "\uc548\uacbd": 180, "\uac00\ubc29": 181, "\ud5e4\ub4dc\ud3f0": 182, "\ud540": 183, "\ucee8\ud14d\ud2b8": 184, "\ub125\ud0c0\uc774": 185, "\ube7d": 186, "\ubaa8\uc790": 187, "\ud0c0\ud22c": 188, "\uc545\uc0c8": 189, "\ud138": 190, "\uc7a5\uac11": 191, "\ucf58\ud0dd\ud2b8\ub80c\uc988": 192, "\ub124\uc77c": 193, "\uc544\ud2b8": 194, "\ubc99\uc5b4\ub9ac": 195, "\ub125": 196, "\ud0c0\uc774": 197, "\ucc45": 198, "\ubcfc\ud39c": 199, "\ub178\ud2b8\ubd81": 200, "\ucef5": 201, "\ud734\ub300\ud3f0": 202, "\ud0a4": 203, "\ubcf4\ub4dc": 204, "\ub9c8\uc6b0\uc2a4": 205, "\ubaa8\ub2c8\ud130": 206, "\uc758\uc790": 207, "\ubb3c\uac74": 208, "\uc548\ud14c\ub098": 209, "\uc790\ub3d9\ucc28": 210, "\ub178\ub798": 211, "\uc74c\uc2dd": 212, "\uc4f0\ub808\uae30": 213, "\ud14c\uc774\ube14": 214, "\uc2a4\ud53c\ucee4": 215, "\uc6b0\uc0b0": 216, "\ub7a8\ud504": 217, "\uce74\uba54\ub77c": 218, "\uc0ac\ub78c": 219, "\ud50c\ub79c": 220, "\ube4c\ub529": 221, "\ub545": 222, "\ubb38\uc2e0": 223, "\ud328\uc158": 224, "\uce5c\uad6c": 225, "\uc720\ud29c\ube0c": 226, "\uc720\ud29c\ubc84": 227, "\uc878\ub77c": 228, "\uc874\ub098": 229, "\uc778\uc0ac": 230, "\ubc29\uc7a5": 231, "\ud300": 232, "\uc6d0": 233, "\uc65c": 234, "\uc548\ub155\ud558\uc138\uc694": 235, "\u314b\u314b": 236, "\u314b": 237, "\uce7c\ub77c": 238, "\ucfe0\uc158": 239, "\uc57c\uc678": 240, "\u314b\u314b\u314b": 241, "\uc778\ud130\ub137": 242, "\uc870\uae08": 243, "\ubaa8\ub378": 244, "\uc608\uc058": 245, "\uc774\uc058": 246, "\ucd94\ucc9c": 247, "\uad6c\ub3c5": 248, "\uad6c": 249, "\ub3c5\uc790": 250, "\uc2e4\ub0b4": 251, "\uc640": 252, "\ub3c8": 253, "\ub313\uae00": 254, "\uac1c": 255}