{"\ud2f0\uc154\uce20": 1, "\uc2a4\uc6e8\ud130": 2, "\ube14\ub77c\uc6b0\uc2a4": 3, "\ud3f4\ub85c\uc154\uce20": 4, "\uc154\uce20": 5, "\ud6c4\ub4dc": 6, "\ud2f0": 7, "\uce74\ub514\uac74": 8, "\ub2c8\ud2b8": 9, "\ud0d1": 10, "\uc870\ub07c": 11, "\ub4dc\ub808\uc2a4": 12, "\ubaa9": 13, "\ud3f4\ub77c": 14, "\uc625\uc2a4\ud3ec\ub4dc": 15, "\uc9d1\uc5c5": 16, "\ud3f4\ub85c": 17, "\ud06c\ub86d\ud0d1": 18, "\ud558\ud504": 19, "\uc9e7\uc740": 20, "\uae34": 21, "\ud314": 22, "\uc0c1\uc758": 23, "\uc800\uc9c0": 24, "\ub370\ub2d8": 25, "\ud0f1\ud06c\ud0d1": 26, "\ubc18": 27, "\ub9b0\ub128": 28, "\ub4dc\ub808\uc2a4\uc154\uce20": 29, "\ud06c\ub86d": 30, "\ud0f1\ud06c": 31, "\uccad\ubc14\uc9c0": 32, "\uc2ac\ub799\uc2a4": 33, "\uc20f": 34, "\ud32c\uce20": 35, "\uce58\ub178": 36, "\ub808\uae45\uc2a4": 37, "\uc2a4\ucee4\ud2b8": 38, "\ubc14\uc9c0": 39, "\ud558\uc758": 40, "\uc2a4\ud0c0\ud0b9": 41, "\ud2b8\ub808\uc774\ub2dd\ubcf5": 42, "\uace8\ub374": 43, "\ucf54\ub4c0": 44, "\ub85c\uc774": 45, "\uce74": 46, "\uace0": 47, "\uce04\ub9ac\ub2dd": 48, "\uce58\ub9c8": 49, "\ud14c\ub2c8\uc2a4": 50, "\uac00\uc8fd": 51, "\uc870\uac70": 52, "\uc2a4\ud0a4": 53, "\ub2c8": 54, "\uc640\uc774\ub4dc": 55, "\ub808\ub354": 56, "\uace8\ub374\ubc14": 57, "\uc9c0": 58, "\ub85c": 59, "\uc774\ubc14\uc9c0": 60, "\ucf54\ud2b8": 61, "\ud2b8\ub80c\uce58": 62, "\ud328\ub529": 63, "\uc7ac\ud0b7": 64, "\uc790\ucf13": 65, "\ube14": 66, "\ub808\uc774\uc800": 67, "\ud30c\uce74": 68, "\ubc14\ub78c\ub9c9\uc774": 69, "\ub808\uc778": 70, "\uc57c": 71, "\uc0c1": 72, "\uc544\uc6b0": 73, "\ud130": 74, "\ub355": 75, "\ub2e4\uc6b4": 76, "\ube14\ub8e8": 77, "\uc885": 78, "\uccad": 79, "\uce90\uc2dc\ubbf8\uc5b4": 80, "\ubca8\ubcb3": 81, "\ud03c\ud2b8": 82, "\ub871": 83, "\ud2b8\ub80c\uce58\ucf54\ud2b8": 84, "\ud56d\uacf5": 85, "\uc810\ud37c": 86, "\ud2b8\ub7ec\ucee4": 87, "\ub9e5\uc2dc": 88, "\ubc14\ub78c": 89, "\ub9c9": 90, "\uc774": 91, "\ub808\uc778\ucf54\ud2b8": 92, "\ub871\ud328\ub529": 93, "\ub7f0\ub2dd\ud654": 94, "\ud558\uc774\ud790": 95, "\ubd80\uce20": 96, "\uc0cc\ub4e4": 97, "\ub85c\ud37c": 98, "\uc2a4\ub2c8\ucee4\uc988": 99, "\ud50c\ub7ab": 100, "\uc288\uc988": 101, "\uc6cc\ucee4": 102, "\uc2ac\ub9bd": 103, "\uc628": 104, "\uc2e0\ubc1c": 105, "\ucee8": 106, "\ubc84\uc2a4": 107, "\ub098\uc774\ud0a4": 108, "\uc544\ub514\ub2e4\uc2a4": 109, "\ud4e8\ub9c8": 110, "\uad70\ud654": 111, "\ucef4\ubc43": 112, "\ud38c\ud504\uc2a4": 113, "\uc2a4\ud2b8\ub7a9": 114, "\ud50c\ub7ab\ud3fc": 115, "\uae00\ub798\ub514\uc5d0\uc774\ud130": 116, "\uc5d0\uc2a4": 117, "\ud30c": 118, "\ub4dc\ub9ac": 119, "\uc720": 120, "\ubaa8\uce74\uc2e0": 121, "\uc625\uc2a4\ud37c\ub4dc": 122, "\uba54\ub9ac\uc81c\uc778": 123, "\ub274\ubc1c": 124, "\uc7a5\ud654": 125, "\ud06c": 126, "\ub85d\uc2a4": 127, "\uc2ac\ub9ac\ud37c": 128, "\uad6c\ub450": 129, "\ud558\uc774": 130, "\ud790": 131, "\ud50c\ub7ab\uc288\uc988": 132, "\ubaa9\uac78\uc774": 133, "\uadc0\uac78\uc774": 134, "\ud314\ucc0c": 135, "\uc2dc\uacc4": 136, "\ubc18\uc9c0": 137, "\ud5e4\uc5b4": 138, "\ubc34\ub4dc": 139, "\uc120\uae00\ub77c\uc2a4": 140, "\uc2a4\uce74\ud504": 141, "\ubaa8\uc790": 142, "\ubca8\ud2b8": 143, "\uc545\uc138\uc0ac\ub9ac": 144, "\uc545\uc138": 145, "\ube0c\ub85c\uce58": 146, "\ucee4\ud504\uc2a4": 147, "\ud1a0\ud2b8": 148, "\ubc31": 149, "\ud074\ub7ec\uce58": 150, "\ud329": 151, "\ud578\ub4dc\ubc31": 152, "\ubaa9\ub3c4\ub9ac": 153, "\ud074\ub9bd": 154, "\ub9c8\uc2a4\ud06c": 155, "\uc591\ub9d0": 156, "\ucf58\ud0dd\ud2b8": 157, "\ub80c\uc988": 158, "\uc548\uacbd": 159, "\uac00\ubc29": 160, "\ud5e4\ub4dc\ud3f0": 161, "\ud540": 162, "\ucee8\ud14d\ud2b8": 163, "\ub125\ud0c0\uc774": 164, "\ucf58\ud0dd\ud2b8\ub80c\uc988": 165, "\ub125": 166, "\ud0c0\uc774": 167, "\ucc45": 168, "\ubcfc\ud39c": 169, "\ub178\ud2b8\ubd81": 170, "\ucef5": 171, "\ud734\ub300\ud3f0": 172, "\ud0a4": 173, "\ubcf4\ub4dc": 174, "\ub9c8\uc6b0\uc2a4": 175, "\ubaa8\ub2c8\ud130": 176, "\uc758\uc790": 177, "\ubb3c\uac74": 178, "\uc548\ud14c\ub098": 179, "\uc790\ub3d9\ucc28": 180, "\ub178\ub798": 181, "\uc74c\uc2dd": 182, "\uc4f0\ub808\uae30": 183, "\ud14c\uc774\ube14": 184, "\uc2a4\ud53c\ucee4": 185, "\uc6b0\uc0b0": 186, "\ub7a8\ud504": 187, "\uce74\uba54\ub77c": 188, "\uc0ac\ub78c": 189, "\ud50c\ub79c": 190, "\ube4c\ub529": 191, "\ub545": 192, "\ubb38\uc2e0": 193, "\ud328\uc158": 194, "\uce5c\uad6c": 195, "\uc720\ud29c\ube0c": 196, "\uc720\ud29c\ubc84": 197, "\uc878\ub77c": 198, "\uc874\ub098": 199, "\uad6c": 200, "\ub3c5\uc790": 201, "\ubc29\uc7a5": 202, "\ud300": 203, "\uc6d0": 204, "\uc65c": 205, "\uc778\uc0ac": 206, "\uc548\ub155\ud558\uc138\uc694": 207, "\ub313\uae00": 208, "\ubaa8\ub378": 209, "\uce7c\ub77c": 210, "\ucfe0\uc158": 211, "\uc57c\uc678": 212, "\uc778\ud130\ub137": 213, "\uc870\uae08": 214, "\uc608\uc058": 215, "\uc774\uc058": 216, "\ucd94\ucc9c": 217, "\uad6c\ub3c5": 218, "\uc2e4\ub0b4": 219, "\uc640": 220, "\ub3c8": 221, "\uac1c": 222}